       IDENTIFICATION DIVISION.
       PROGRAM-ID. APP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 RESULTADO            PIC 9(4).

       01 LS-SENHA             PIC X(6) VALUE '123456'.

       01 LS-VALIDA            PIC X.

       01 LS-USUARIO            PIC X(20) VALUE 'Prof Paulo'.

       01 LS-VALIDA-USUARIO     PIC X.

       PROCEDURE DIVISION.
       CALL "LOGIN" USING LS-USUARIO LS-VALIDA-USUARIO
       DISPLAY "USUARIO: " LS-USUARIO

       CALL 'SENHA' USING LS-SENHA LS-VALIDA
       DISPLAY "SENHA DO USUARIO " LS-SENHA

       STOP RUN.
