       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOGIN.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-USUARIO            PIC X(6).
       01 LS-VALIDA-USUARIO     PIC X.
   
       PROCEDURE DIVISION USING LS-USUARIO LS-VALIDA-USUARIO.
       IF FUNCTION LENGTH(FUNCTION TRIM(LS-USUARIO)) > 3
           MOVE "S" TO LS-VALIDA-USUARIO
       ELSE
           MOVE "N" TO LS-VALIDA-USUARIO
       END-IF
       GOBACK.
       END PROGRAM LOGIN.

