       IDENTIFICATION DIVISION.
       PROGRAM-ID. SENHA.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-SENHA      PIC X(6).
       01 LS-VALIDA     PIC X.
   
       PROCEDURE DIVISION USING LS-SENHA LS-VALIDA.
       IF FUNCTION LENGTH(FUNCTION TRIM(LS-SENHA)) >= 6
           MOVE "S" TO LS-VALIDA
       ELSE
           MOVE "N" TO LS-VALIDA
       END-IF
       GOBACK.
       END PROGRAM SENHA.

